void main() {

  String username = "saja";
  String password = "1234";
  int age = 24;
  bool isActive = true;

  // =========================
  // 🔹 If Condition (شرط بسيط)
  // =========================
  // إذا المستخدم عمره فوق 18 نسمح له يكمل
  if (age >= 18) {
    print("مسموح الدخول حسب العمر ✅");
  }

  // =========================
  // 🔹 If - Else (حالتين فقط)
  // =========================
  if (isActive) {
    print("الحساب مفعل 🔓");
  } else {
    print("الحساب غير مفعل 🔒");
  }

  // =========================
  // 🔹 If - Else If (أكثر من شرط)
  // =========================
  if (age >= 60) {
    print("فئة كبار السن 👴");
  } else if (age >= 30) {
    print("فئة البالغين 👨");
  } else if (age >= 18) {
    print("فئة الشباب 👩");
  } else {
    print("أقل من 18 🚫");
  }

  // =========================
  // 🔹 Advanced: Login System
  // =========================
  // استخدام AND (&&) لازم كل الشروط تكون صحيحة
  if (username == "saja" && password == "1234") {

    print("تم تسجيل الدخول بنجاح 🎉");

    // 🔹 Nested If (if داخل if)
    // بعد تسجيل الدخول، نتحقق من حالة الحساب
    if (isActive) {
      print("يمكنك استخدام النظام 🔥");
    } else {
      print("يرجى تفعيل الحساب أولاً ⚠️");
    }

  } else {
    print("بيانات الدخول خاطئة ❌");
  }

  // =========================
  // 🔹 Advanced: OR Operator
  // =========================
  // OR (||) يكفي شرط واحد يكون صحيح
  if (username == "admin" || username == "saja") {
    print("عندك صلاحيات دخول خاصة ⭐");
  }

  // =========================
  // 🔹 ملاحظة مهمة (Optimization)
  // =========================
  // ترتيب الشروط مهم! من الأكبر للأصغر
  int score = 85;

  if (score >= 90) {
    print("A");
  } else if (score >= 80) {
    print("B");
  } else if (score >= 70) {
    print("C");
  } else {
    print("F");
  }

}