void main() {

  int a = 10;
  int b = 3;

  // ========================
  // Addition (+) جمع
  // ========================
  print("Addition: ${a + b}"); // 10 + 3 = 13

  // ========================
  // Subtraction (-) طرح
  // ========================
  print("Subtraction: ${a - b}"); // 10 - 3 = 7

  // ========================
  // Unary Minus (-expr) عكس الإشارة
  // ========================
  print("Unary Minus: ${-a}"); // -10

  // ========================
  // Multiplication (*) ضرب
  // ========================
  print("Multiplication: ${a * b}"); // 10 * 3 = 30

  // ========================
  // Division (/) قسمة (تعطي double)
  // ========================
  print("Division: ${a / b}"); // 10 / 3 = 3.333...

  // ========================
  // Integer Division (~/) قسمة بدون كسور
  // ========================
  print("Integer Division: ${a ~/ b}"); // 10 ~/ 3 = 3

  // ========================
  // Modulus (%) باقي القسمة
  // ========================
  print("Modulus: ${a % b}"); // 10 % 3 = 1

}